hyunkoome/ESP32_WIFI_Loc/csi/firmware/csi_send/sdkconfig.defaults
# CSI 송신 펌웨어 기본 설정.
# 출처: espressif/esp-csi csi_send/sdkconfig.defaults (Apache-2.0)
# 변경점: 대상 보드 YD-ESP32-S3 N16R8(16MB Flash / 8MB Octal PSRAM) 설정을 추가.
#

# --- 대상 칩 / 메모리 (N16R8) ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y

# --- 원본 CSI 설정 ---
CONFIG_PARTITION_TABLE_OFFSET=0xa000
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=128
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_FREERTOS_HZ=1000
